In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('titanic.csv')

In [4]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [6]:
df = df.drop(df[['PassengerId','Name', 'SibSp', 'Parch','Ticket','Cabin','Embarked']],axis='columns')

In [7]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [9]:
inputs = df.drop('Survived', axis='columns')
target = df.Survived

In [13]:
inputs.head(10)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500
5       3    male   NaN   8.4583
6       1    male  54.0  51.8625
7       3    male   2.0  21.0750
8       3  female  27.0  11.1333
9       2  female  14.0  30.0708

In [14]:
target.head(10)

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [15]:
from sklearn.preprocessing import LabelEncoder
lb = LabelEncoder()

In [17]:
inputs['Sex_n'] = lb.fit_transform(inputs['Sex'])

In [19]:
inputs

     Pclass     Sex   Age     Fare  Sex_n
0         3    male  22.0   7.2500      1
1         1  female  38.0  71.2833      0
2         3  female  26.0   7.9250      0
3         1  female  35.0  53.1000      0
4         3    male  35.0   8.0500      1
..      ...     ...   ...      ...    ...
886       2    male  27.0  13.0000      1
887       1  female  19.0  30.0000      0
888       3  female   NaN  23.4500      0
889       1    male  26.0  30.0000      1
890       3    male  32.0   7.7500      1

[891 rows x 5 columns]

In [20]:
inputs = inputs.drop('Sex', axis='columns')

In [22]:
inputs.head()

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [26]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [35]:

inputs.Age = (inputs.Age.fillna(inputs.Age.mean()))

In [36]:
inputs.head(10)

   Pclass        Age     Fare  Sex_n
0       3  22.000000   7.2500      1
1       1  38.000000  71.2833      0
2       3  26.000000   7.9250      0
3       1  35.000000  53.1000      0
4       3  35.000000   8.0500      1
5       3  29.699118   8.4583      1
6       1  54.000000  51.8625      1
7       3   2.000000  21.0750      1
8       3  27.000000  11.1333      0
9       2  14.000000  30.0708      0

In [37]:
from sklearn.model_selection import train_test_split

In [38]:
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size = 0.3)

In [40]:
len(X_test)

268

In [41]:
len(X_train)

623

In [42]:
from sklearn.naive_bayes import GaussianNB

In [43]:
model = GaussianNB()

In [44]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [55]:
model.predict(X_test[:10])

array([0, 1, 0, 0, 1, 1, 1, 1, 1, 0], dtype=int64)

In [51]:
X_test

     Pclass        Age     Fare  Sex_n
30        1  40.000000  27.7208      1
887       1  19.000000  30.0000      0
385       2  18.000000  73.5000      1
646       3  19.000000   7.8958      1
161       2  40.000000  15.7500      0
..      ...        ...      ...    ...
591       1  52.000000  78.2667      0
320       3  22.000000   7.2500      1
667       3  29.699118   7.7750      1
324       3  29.699118  69.5500      1
293       3  24.000000   8.8500      0

[268 rows x 4 columns]

In [54]:
y_test[:10]

30     0
887    1
385    0
646    0
161    1
319    1
618    1
865    1
251    0
461    0
Name: Survived, dtype: int64

In [53]:
model.score(X_test, y_test)

0.8059701492537313

In [56]:
model.predict_proba(X_test[:10])

array([[0.79780327, 0.20219673],
       [0.08459397, 0.91540603],
       [0.73668542, 0.26331458],
       [0.94273462, 0.05726538],
       [0.28329057, 0.71670943],
       [0.00148051, 0.99851949],
       [0.15544682, 0.84455318],
       [0.28950682, 0.71049318],
       [0.39614518, 0.60385482],
       [0.95455635, 0.04544365]])